# Pandas - DataFrames

In [1]:
#
import numpy as np
import pandas as pd
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
random_n = randn(5, 4)
random_n

array([[-2.106051  ,  0.34677305, -1.49997099, -0.38091104],
       [ 1.35818017,  0.05303071, -0.35582287, -0.56557536],
       [ 1.09043234,  0.80421348,  0.0823233 , -0.20615293],
       [-1.27075175, -0.29126335, -1.45797621, -0.44101954],
       [-0.56432261,  0.73222669,  0.42212673, -0.16003341]])

In [11]:
df = pd.DataFrame(random_n, ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [12]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [14]:
df.shape

(5, 4)

In [15]:
df['W']

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [18]:
df[['W', 'Z']]

          W         Z
A -1.467514  0.485809
B  0.392489  1.541990
C  0.666319  1.407338
D  0.641806  1.028293
E -1.972605 -1.223082

In [21]:
df.loc['A']

W   -1.467514
X   -0.494095
Y   -0.162535
Z    0.485809
Name: A, dtype: float64

In [22]:
df.iloc[1]

W    0.392489
X    0.221491
Y   -0.855196
Z    1.541990
Name: B, dtype: float64

In [23]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [27]:
#You can use inplace for a permanent drop
df.drop('W', axis=1)

          X         Y         Z
A -0.494095 -0.162535  0.485809
B  0.221491 -0.855196  1.541990
C -0.538235 -0.568581  1.407338
D -0.905100 -0.391157  1.028293
E -0.866885  0.720788 -1.223082

In [29]:
df[df['W'] > 0]

          W         X         Y         Z
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [30]:
df[df['W'] > 0]['Z']

B    1.541990
C    1.407338
D    1.028293
Name: Z, dtype: float64

In [38]:
df[(df['W'] > 0) | (df['Z'] > 0)]

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [39]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [40]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.467514 -0.494095 -0.162535  0.485809
1     B  0.392489  0.221491 -0.855196  1.541990
2     C  0.666319 -0.538235 -0.568581  1.407338
3     D  0.641806 -0.905100 -0.391157  1.028293
4     E -1.972605 -0.866885  0.720788 -1.223082

In [41]:
string = 'MA MI MO MU ME'.split()

In [42]:
string

['MA', 'MI', 'MO', 'MU', 'ME']

In [43]:
df['alphas'] = string

In [44]:
df

          W         X         Y         Z alphas
A -1.467514 -0.494095 -0.162535  0.485809     MA
B  0.392489  0.221491 -0.855196  1.541990     MI
C  0.666319 -0.538235 -0.568581  1.407338     MO
D  0.641806 -0.905100 -0.391157  1.028293     MU
E -1.972605 -0.866885  0.720788 -1.223082     ME

# Pandas - Multilevel and Higher Key DataFrames

In [2]:
#Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [5]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [12]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [18]:
df.index.names = ['Groups', 'Indexes']

In [19]:
df

                       A         B
Groups Indexes
G1     1        1.331065  0.482104
       2        1.755475  0.974862
       3       -1.424068 -0.419647
G2     1        0.340146 -0.412213
       2        0.614493 -0.229105
       3       -1.737183 -0.879449

In [21]:
df.loc['G1'].loc[3]['B']

-0.4196471380217498

#  Pandas - Missing data

In [37]:
dict = {'a': [1, 2, 3], 'b': [1, 2, np.nan], 'c': [np.nan, 3, np.nan]}

In [38]:
df = pd.DataFrame(dict)

In [39]:
df

   a    b    c
0  1  1.0  NaN
1  2  2.0  3.0
2  3  NaN  NaN

In [40]:
df.dropna(axis=1)

   a
0  1
1  2
2  3

In [42]:
df.dropna(thresh=2)

   a    b    c
0  1  1.0  NaN
1  2  2.0  3.0

In [43]:
df.fillna('FILLABLE')

   a         b         c
0  1         1  FILLABLE
1  2         2         3
2  3  FILLABLE  FILLABLE

In [52]:
df['b'] = df['b'].fillna(df['b'].mean())

# Pandas - GroupBy

The groupby method allows you to group rows of data together and call aggregate functions

In [57]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
    'Sales':[200,120,340,124,243,350]}

In [58]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [59]:
df = pd.DataFrame(data)

In [60]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [75]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [79]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [83]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [84]:
df.groupby('Company').describe().transpose().loc['Sales']['FB']

count      2.000000
mean     296.500000
std       75.660426
min      243.000000
25%      269.750000
50%      296.500000
75%      323.250000
max      350.000000
Name: FB, dtype: float64

# Pandas - Merging, Joining and Concatenation

In [11]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3'],
                   'DE': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [4]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [5]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [12]:
df1

    A   B   C   D  DE
0  A0  B0  C0  D0  D0
1  A1  B1  C1  D1  D1
2  A2  B2  C2  D2  D2
3  A3  B3  C3  D3  D3

In [7]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [8]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Keep in mind that dimensions should match along the axis you are concatenating on.

In [14]:
pd.concat([df1,df2,df3], sort=False)

      A    B    C    D   DE
0    A0   B0   C0   D0   D0
1    A1   B1   C1   D1   D1
2    A2   B2   C2   D2   D2
3    A3   B3   C3   D3   D3
4    A4   B4   C4   D4  NaN
5    A5   B5   C5   D5  NaN
6    A6   B6   C6   D6  NaN
7    A7   B7   C7   D7  NaN
8    A8   B8   C8   D8  NaN
9    A9   B9   C9   D9  NaN
10  A10  B10  C10  D10  NaN
11  A11  B11  C11  D11  NaN

In [15]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D   DE    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Merging

In [18]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [19]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [20]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [17]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [21]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [22]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [23]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [24]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [25]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [26]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [27]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining

In [28]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [29]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [30]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [31]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [32]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

## Operations

In [46]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Unique Values

In [50]:
df['col2'].unique()

array([444, 555, 666])

In [52]:
df['col2'].nunique()

3

In [54]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

#### Selecting Data

In [59]:
newdf = df[(df['col1'] >= 1) & (df['col2'] == 444)]
newdf

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

#### Applying functions

In [71]:
def times2(x): 
    return x * 2;

In [72]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [76]:
df['col3'].apply(len)
df['col1'].sum()

10

** Permanently Removing a Column**

In [77]:
del df['col1']

In [78]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Getting Column and Indexes **

In [79]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [80]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [81]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Finding Null Values **

In [82]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [83]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [84]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [86]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [88]:
df.pivot_table(values='D',index=['B', 'A'],columns=['C'])

C          x    y
B   A
one bar  4.0  1.0
    foo  1.0  3.0
two bar  NaN  5.0
    foo  2.0  NaN

# Data Input and Output

** Read the docs about Excel, HTML, SQL and more **

### Poa Bro